Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70Q20B.PIC
      <edc:SFRDef edc:_addr="0x400300A4" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:cname="MCAN0_RXF0S" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F0FL" edc:desc="Receive FIFO 0 Fill Level" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:desc="Receive FIFO 0 Get Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:desc="Receive FIFO 0 Put Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:desc="Receive FIFO 0 Fill Level" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:desc="Receive FIFO 0 Message Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300A8" edc:access="--------------------------nnnnnn" edc:cname="MCAN0_RXF0A" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F0AI" edc:desc="Receive FIFO 0 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300AC" edc:access="----------------nnnnnnnnnnnnnn--" edc:cname="MCAN0_RXBC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RBSA" edc:desc="Receive Buffer Start Address" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300B0" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN0_RXF1C" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1SA" edc:desc="Receive FIFO 1 Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:desc="Receive FIFO 1 Start Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:desc="Receive FIFO 1 Watermark" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:desc="FIFO 1 Operation Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300B4" edc:access="rr----rr--rrrrrr--rrrrrr-rrrrrrr" edc:cname="MCAN0_RXF1S" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F1FL" edc:desc="Receive FIFO 1 Fill Level" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1GI" edc:desc="Receive FIFO 1 Get Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1PI" edc:desc="Receive FIFO 1 Put Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1F" edc:desc="Receive FIFO 1 Fill Level" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Receive FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMS" edc:desc="Debug Message Status" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle state, wait for reception of debug messages, DMA request is cleared." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MSG_A" edc:desc="Debug message A received." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MSG_AB" edc:desc="Debug messages A, B received." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MSG_ABC" edc:desc="Debug messages A, B, C received, DMA request is set." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300B8" edc:access="--------------------------nnnnnn" edc:cname="MCAN0_RXF1A" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F1AI" edc:desc="Receive FIFO 1 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300BC" edc:access="---------------------nnn-nnn-nnn" edc:cname="MCAN0_RXESC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F0DS" edc:desc="Receive FIFO 0 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte data field" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_12_BYTE" edc:desc="12-byte data field" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte data field" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_20_BYTE" edc:desc="20-byte data field" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24_BYTE" edc:desc="24-byte data field" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte data field" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_48_BYTE" edc:desc="48-byte data field" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64-byte data field" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1DS" edc:desc="Receive FIFO 1 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte data field" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_12_BYTE" edc:desc="12-byte data field" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte data field" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_20_BYTE" edc:desc="20-byte data field" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24_BYTE" edc:desc="24-byte data field" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte data field" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_48_BYTE" edc:desc="48-byte data field" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64-byte data field" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RBDS" edc:desc="Receive Buffer Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte data field" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_12_BYTE" edc:desc="12-byte data field" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte data field" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_20_BYTE" edc:desc="20-byte data field" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24_BYTE" edc:desc="24-byte data field" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte data field" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_48_BYTE" edc:desc="48-byte data field" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64-byte data field" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300C0" edc:access="-nnnnnnn--nnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN0_TXBC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TBSA" edc:desc="Tx Buffers Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="NDTB" edc:desc="Number of Dedicated Transmit Buffers" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFQS" edc:desc="Transmit FIFO/Queue Size" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="TFQM" edc:desc="Tx FIFO/Queue Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300C4" edc:access="----------rrrrrr---rrrrr--rrrrrr" edc:cname="MCAN0_TXFQS" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFFL" edc:desc="Tx FIFO Free Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFGI" edc:desc="Tx FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TFQPI" edc:desc="Tx FIFO/Queue Put Index" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TFQF" edc:desc="Tx FIFO/Queue Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300C8" edc:access="-----------------------------nnn" edc:cname="MCAN0_TXESC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBDS" edc:desc="Tx Buffer Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte data field" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_12_BYTE" edc:desc="12-byte data field" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte data field" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_20_BYTE" edc:desc="20-byte data field" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24_BYTE" edc:desc="24-byte data field" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte data field" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_48_BYTE" edc:desc="48- byte data field" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64-byte data field" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300CC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_TXBRP" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRP0" edc:desc="Transmission Request Pending for Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:desc="Transmission Request Pending for Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:desc="Transmission Request Pending for Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:desc="Transmission Request Pending for Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:desc="Transmission Request Pending for Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:desc="Transmission Request Pending for Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:desc="Transmission Request Pending for Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:desc="Transmission Request Pending for Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:desc="Transmission Request Pending for Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:desc="Transmission Request Pending for Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:desc="Transmission Request Pending for Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:desc="Transmission Request Pending for Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:desc="Transmission Request Pending for Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:desc="Transmission Request Pending for Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:desc="Transmission Request Pending for Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:desc="Transmission Request Pending for Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:desc="Transmission Request Pending for Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:desc="Transmission Request Pending for Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:desc="Transmission Request Pending for Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:desc="Transmission Request Pending for Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:desc="Transmission Request Pending for Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:desc="Transmission Request Pending for Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:desc="Transmission Request Pending for Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:desc="Transmission Request Pending for Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:desc="Transmission Request Pending for Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:desc="Transmission Request Pending for Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:desc="Transmission Request Pending for Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:desc="Transmission Request Pending for Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:desc="Transmission Request Pending for Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:desc="Transmission Request Pending for Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:desc="Transmission Request Pending for Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:desc="Transmission Request Pending for Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_TXBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AR0" edc:desc="Add Request for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:desc="Add Request for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:desc="Add Request for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:desc="Add Request for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:desc="Add Request for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:desc="Add Request for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:desc="Add Request for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:desc="Add Request for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:desc="Add Request for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:desc="Add Request for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:desc="Add Request for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:desc="Add Request for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:desc="Add Request for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:desc="Add Request for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:desc="Add Request for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:desc="Add Request for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:desc="Add Request for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:desc="Add Request for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:desc="Add Request for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:desc="Add Request for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:desc="Add Request for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:desc="Add Request for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:desc="Add Request for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:desc="Add Request for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:desc="Add Request for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:desc="Add Request for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:desc="Add Request for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:desc="Add Request for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:desc="Add Request for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:desc="Add Request for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:desc="Add Request for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:desc="Add Request for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_TXBCR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CR0" edc:desc="Cancellation Request for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:desc="Cancellation Request for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:desc="Cancellation Request for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:desc="Cancellation Request for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:desc="Cancellation Request for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:desc="Cancellation Request for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:desc="Cancellation Request for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:desc="Cancellation Request for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:desc="Cancellation Request for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:desc="Cancellation Request for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:desc="Cancellation Request for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:desc="Cancellation Request for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:desc="Cancellation Request for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:desc="Cancellation Request for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:desc="Cancellation Request for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:desc="Cancellation Request for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:desc="Cancellation Request for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:desc="Cancellation Request for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:desc="Cancellation Request for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:desc="Cancellation Request for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:desc="Cancellation Request for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:desc="Cancellation Request for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:desc="Cancellation Request for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:desc="Cancellation Request for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:desc="Cancellation Request for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:desc="Cancellation Request for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:desc="Cancellation Request for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:desc="Cancellation Request for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:desc="Cancellation Request for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:desc="Cancellation Request for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:desc="Cancellation Request for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:desc="Cancellation Request for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
