Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70Q20B.PIC
      <edc:SFRDef edc:_addr="0x40038174" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038178" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003817C" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038180" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038184" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038188" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038190" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038194" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038198" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPIS" edc:desc="Received SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTIS" edc:desc="NAKed OUT Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINIS" edc:desc="NAKed IN Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDIS" edc:desc="STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
