Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70Q20B.PIC
      <edc:SFRDef edc:_addr="0x40050038" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_RPQ" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPQ" edc:desc="Received Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005003C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TPQ" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TPQ" edc:desc="Transmit Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050040" edc:access="n-------------------nnnnnnnnnnnn" edc:cname="GMAC_TPSF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TPB1ADR" edc:desc="Transmit Partial Store and Forward Address" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="ENTXP" edc:desc="Enable TX Partial Store and Forward Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050044" edc:access="n-------------------nnnnnnnnnnnn" edc:cname="GMAC_RPSF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB1ADR" edc:desc="Receive Partial Store and Forward Address" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="ENRXP" edc:desc="Enable RX Partial Store and Forward Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050048" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="GMAC_RJFML" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FML" edc:desc="Frame Max Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005004C" edc:offset="0x34"/>
      <edc:SFRDef edc:_addr="0x40050080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_HRB" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Hash Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_HRT" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Hash Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050088" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x400500A8" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TIDM1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match 1" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID1" edc:desc="Enable Copying of TID Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400500AC" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TIDM2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match 2" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID2" edc:desc="Enable Copying of TID Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400500B0" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TIDM3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match 3" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID3" edc:desc="Enable Copying of TID Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400500B4" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TIDM4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match 4" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID4" edc:desc="Enable Copying of TID Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400500B8" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_WOL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IP" edc:desc="ARP Request IP Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="MAG" edc:desc="Magic Packet Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARP" edc:desc="ARP Request IP Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SA1" edc:desc="Specific Address Register 1 Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTI" edc:desc="Multicast Hash Event Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400500BC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_IPGS" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FL" edc:desc="Frame Length" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
